# Worksheet for pandas

### Create 5 different python objects as following:
*  Python list with string values. (Store it in variable data_labels_1)
*  Python list with integer values. (Store it in variable data_values_1)
*  A numpy array. (Store it in variable series_numpy_array_1)
*  A python dictionary (Store it in variable dict2)


### Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. Store it in variable cities_population.
* indexes = ['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']
* data = [200000, 1600000, 600000, 500000, 350000]
### Create different python series for each question below out of the data above as follows:
* Using python list data_values_1. What do you observe regarding the indexes?
* Using python list data_labels_1. What do you observe regarding the datatype of the series?
* Using data_values_1 as data values and data_labels_1 as indexes
* Using numpy array series_numpy_array_1.
* Using numpy array series_numpy_array_1. Set the indexes to data_labels_1.
* Using python dictionary dict2. What do you observe regarding the indexes?
* Fetch the indexes of the series cities_population.
### Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. Store it in variable cities_population_2.
* indexes = ['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal']
* data = [150000, 1600000, 600000, 500000, 300000]

### Perform addition on series 'cities_population' and 'cities_population_2'. What do you observe?

#### Create a pandas DataFrame out of the following data. Store it in the variable df_.
* serial_no: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] #row indexes
* subjects : ['ENG', 'NEP', 'MAT', 'SCI', 'COM'] #column headers
* students : ['RAM','SHYAM','GITA','HARI','SITA','SUSHILA','RAMESH','SUBODH','ANIL','RUPA']
* marks :marks =[[57, 34, 93, 84, 54], [48, 49, 52, 89, 64], [66, 64, 75, 38, 84], [55, 47, 90, 82, 37], [45, 93, 70, 53, 76], * * [45, 63, 33, 53, 72], [68, 34, 42, 43, 84], [62, 69, 67, 50, 94], [59, 33, 51, 68, 33], [57, 91, 60, 37, 44]]

#### Fetch the records of all the students who have passed in Nepali. 
#### Fetch the names of all the students who have scored a first division mark in science.
#### Note that a score of more than or equal to 70 is First Division.

# Importing necessary packages ie pandas and numpy

In [49]:
import pandas as pd

# Reading csv file that is in current directory

In [73]:
a=pd.read_csv("student.csv")
a.head()       #displays top 5 record that is present in file student.csv  similary tail can be used to extract bottom record
#a.head(10)  --->  10 RECORD FROM TOP       a.tail(7)  10 RECORD FROM bottom

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,higher education,higher education,at_home,teacher,...,very good,medium,high,very low,very low,good,6,5,6,6
1,GP,F,17,U,GT3,T,primary education (4th grade),primary education (4th grade),at_home,other,...,excellent,medium,medium,very low,very low,good,4,5,5,6
2,GP,F,15,U,LE3,T,primary education (4th grade),primary education (4th grade),at_home,other,...,very good,medium,low,low,medium,good,10,7,8,10
3,GP,F,15,U,GT3,T,higher education,5th to 9th grade,health,services,...,good,low,low,very low,very low,excellent,2,15,14,15
4,GP,F,16,U,GT3,T,secondary education,secondary education,other,other,...,very good,medium,low,very low,low,excellent,4,6,10,10

In [75]:
len(a.columns)   #total number of columns

33

In [85]:
import numpy
a['address'][0]= numpy.NaN                    #assigning Null value to some data
a['Pstatus'][[1,2,3]]=numpy.NaN               #assigning MULTIPLE Null value to mULTIPLE data

C:\Users\LEGION\AppData\Local\Temp\ipykernel_23004\20926728.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a['address'][0]= numpy.NaN                    #assigning Null value to some data
C:\Users\LEGION\AppData\Local\Temp\ipykernel_23004\20926728.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a['Pstatus'][[1,2,3]]=numpy.NaN               #assigning MULTIPLE Null value to mULTIPLE data

In [88]:
#checking if we have sucessfully entered null value or not
a['address'][0]
a['Pstatus'][[1,2,3]]

1    NaN
2    NaN
3    NaN
Name: Pstatus, dtype: object

In [89]:
a.isnull().sum()                   #counting  presence of null value in each column

school        0
sex           0
age           0
address       4
famsize       0
Pstatus       3
Medu          0
Fedu          0
Mjob          0
Fjob          0
reason        0
guardian      0
traveltime    0
studytime     0
failures      0
schoolsup     0
famsup        0
paid          0
activities    0
nursery       0
higher        0
internet      0
romantic      0
famrel        0
freetime      0
goout         0
Dalc          0
Walc          0
health        0
absences      0
G1            0
G2            0
G3            0
dtype: int64

In [66]:
a.describe()

              age    failures    absences          G1          G2          G3
count  395.000000  395.000000  395.000000  395.000000  395.000000  395.000000
mean    16.696203    0.334177    5.708861   10.908861   10.713924   10.415190
std      1.276043    0.743651    8.003096    3.319195    3.761505    4.581443
min     15.000000    0.000000    0.000000    3.000000    0.000000    0.000000
25%     16.000000    0.000000    0.000000    8.000000    9.000000    8.000000
50%     17.000000    0.000000    4.000000   11.000000   11.000000   11.000000
75%     18.000000    0.000000    8.000000   13.000000   13.000000   14.000000
max     22.000000    3.000000   75.000000   19.000000   19.000000   20.000000

In [94]:
rows_with_nan = a[a.isnull().any(axis=1)]         #checking row with null value
rows_with_nan

In [99]:
len(rows_with_nan)         #counting number of column

4

In [114]:
#as all attribute(column) has not numeric data only specific field has numeric data 
#so we have only calculated mean of some specific numeric field
print(a['age'].mean())
print(a['G1'].mean())

16.696202531645568
10.90886075949367

In [105]:
b=pd.read_csv("sales_data.csv")

In [106]:
b

          day  burger  pizza  coke  fries  cake
0      Sunday      59     33   102     80    25
1      Monday      47     20   123    100    27
2     Tuesday      65     25   128     97    21
3   Wednesday      67     35   124     83    21
4    Thursday      69     22   123     87    30
5      Friday      89     28    93     98    20
6    Saturday      57     24   145     83    22
7      Sunday      81     22   129     90    25
8      Monday      72     30   126     98    20
9     Tuesday      83     34   101     87    29
10  Wednesday      45     37   109    100    27
11   Thursday      64     21   100     91    29
12     Friday      65     33   118     85    21
13   Saturday      54     25   150     87    27

In [110]:
b.drop(columns='day',inplace=True) #now we have removed one field that is only one non numeric field(colum)

In [111]:
b

    burger  pizza  coke  fries  cake
0       59     33   102     80    25
1       47     20   123    100    27
2       65     25   128     97    21
3       67     35   124     83    21
4       69     22   123     87    30
5       89     28    93     98    20
6       57     24   145     83    22
7       81     22   129     90    25
8       72     30   126     98    20
9       83     34   101     87    29
10      45     37   109    100    27
11      64     21   100     91    29
12      65     33   118     85    21
13      54     25   150     87    27

In [112]:
b.mean()   #now combinedly  we can calculated mean at once for all field

burger     65.500000
pizza      27.785714
coke      119.357143
fries      90.428571
cake       24.571429
dtype: float64

In [115]:
b.corr()    #correlation

          burger     pizza      coke     fries      cake
burger  1.000000  0.024109 -0.359896 -0.057545 -0.238129
pizza   0.024109  1.000000 -0.350633 -0.167520 -0.265794
coke   -0.359896 -0.350633  1.000000 -0.173612 -0.138893
fries  -0.057545 -0.167520 -0.173612  1.000000 -0.077210
cake   -0.238129 -0.265794 -0.138893 -0.077210  1.000000

In [116]:
b.kurtosis()

burger   -0.421825
pizza    -1.551331
coke     -0.514802
fries    -1.492063
cake     -1.676700
dtype: float64

Create 5 different python objects as following:
Python list with string values. (Store it in variable data_labels_1)
Python list with integer values. (Store it in variable data_values_1)
A numpy array. (Store it in variable series_numpy_array_1)
A python dictionary (Store it in variable dict2)

In [119]:
import numpy as np

# Creating a Python list with string values
data_labels_1 = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"]

# Creating a Python list with integer values
data_values_1 = [23, 45, 12, 34, 56]

# Creating a numpy array
series_numpy_array_1 = np.array([10, 20, 30, 40, 50])

# Creating a Python dictionary
dict2 = {"name": "Alice", "age": 30, "city": "New York"}


print(data_labels_1)
print(data_values_1)
print(series_numpy_array_1)
print(dict2)

['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']
[23, 45, 12, 34, 56]
[10 20 30 40 50]
{'name': 'Alice', 'age': 30, 'city': 'New York'}

* Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. Store it in variable cities_population.
##### indexes = ['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']
##### data = [200000, 1600000, 600000, 500000, 350000]

In [120]:
import pandas as pd

indexes = ['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']
data = [200000, 1600000, 600000, 500000, 350000]

# Creating the series with cities as indexes and populations as data
cities_population = pd.Series(data, index=indexes)

print(cities_population)

Biratnagar      200000
Kathmandu      1600000
Lalitpur        600000
Pokhara         500000
Narayangarh     350000
dtype: int64

* Create different python series for each question below out of the data above as follows:
* Using python list data_values_1. What do you observe regarding the indexes?
* Using python list data_labels_1. What do you observe regarding the datatype of the series?
* Using data_values_1 as data values and data_labels_1 as indexes
* Using numpy array series_numpy_array_1.
* Using numpy array series_numpy_array_1. Set the indexes to data_labels_1.
* Using python dictionary dict2. What do you observe regarding the indexes?

In [121]:
data_values_1 = [23, 45, 12, 34, 56]
series_1 = pd.Series(data_values_1)
print(series_1)

0    23
1    45
2    12
3    34
4    56
dtype: int64

In [122]:
data_labels_1 = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"]
series_2 = pd.Series(data_labels_1)
print(series_2)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
dtype: object

In [123]:
series_3 = pd.Series(data_values_1, index=data_labels_1)
print(series_3)

Monday       23
Tuesday      45
Wednesday    12
Thursday     34
Friday       56
dtype: int64

In [124]:
import numpy as np

series_numpy_array_1 = np.array([10, 20, 30, 40, 50])
series_4 = pd.Series(series_numpy_array_1)
print(series_4)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [125]:
series_5 = pd.Series(series_numpy_array_1, index=data_labels_1)
print(series_5)

Monday       10
Tuesday      20
Wednesday    30
Thursday     40
Friday       50
dtype: int32

In [126]:
dict2 = {"name": "Alice", "age": 30, "city": "New York"}
series_6 = pd.Series(dict2)
print(series_6)

name       Alice
age           30
city    New York
dtype: object

In [127]:
cities_population.index

Index(['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh'], dtype='object')

Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. Store it in variable cities_population_2.
indexes = ['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal']
data = [150000, 1600000, 600000, 500000, 300000]

In [129]:
import pandas as pd

indexes = ['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal']
data = [150000, 1600000, 600000, 500000, 300000]

# Creating the series with city names as indexes and their populations as data
cities_population_2 = pd.Series(data, index=indexes)

print(cities_population_2)

Bhaktapur     150000
Kathmandu    1600000
Lalitpur      600000
Pokhara       500000
Butwal        300000
dtype: int64

Perform addition on series 'cities_population' and 'cities_population_2'. What do you observe?

In [130]:
cities_population+cities_population_2

Bhaktapur            NaN
Biratnagar           NaN
Butwal               NaN
Kathmandu      3200000.0
Lalitpur       1200000.0
Narayangarh          NaN
Pokhara        1000000.0
dtype: float64

In [131]:
import pandas as pd

# Given data
serial_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
subjects = ['ENG', 'NEP', 'MAT', 'SCI', 'COM']
students = ['RAM','SHYAM','GITA','HARI','SITA','SUSHILA','RAMESH','SUBODH','ANIL','RUPA']
marks = [
    [57, 34, 93, 84, 54], [48, 49, 52, 89, 64], [66, 64, 75, 38, 84],
    [55, 47, 90, 82, 37], [45, 93, 70, 53, 76], [45, 63, 33, 53, 72],
    [68, 34, 42, 43, 84], [62, 69, 67, 50, 94], [59, 33, 51, 68, 33],
    [57, 91, 60, 37, 44]
]

# Creating the DataFrame
df_ = pd.DataFrame(marks, index=serial_no, columns=subjects)

df_['Students'] = students

print(df_)

    ENG  NEP  MAT  SCI  COM Students
1    57   34   93   84   54      RAM
2    48   49   52   89   64    SHYAM
3    66   64   75   38   84     GITA
4    55   47   90   82   37     HARI
5    45   93   70   53   76     SITA
6    45   63   33   53   72  SUSHILA
7    68   34   42   43   84   RAMESH
8    62   69   67   50   94   SUBODH
9    59   33   51   68   33     ANIL
10   57   91   60   37   44     RUPA

In [133]:
cols = ['Students'] + [col for col in df_ if col != 'Students']

In [135]:
df_=df_[cols]

In [136]:
df_

   Students  ENG  NEP  MAT  SCI  COM
1       RAM   57   34   93   84   54
2     SHYAM   48   49   52   89   64
3      GITA   66   64   75   38   84
4      HARI   55   47   90   82   37
5      SITA   45   93   70   53   76
6   SUSHILA   45   63   33   53   72
7    RAMESH   68   34   42   43   84
8    SUBODH   62   69   67   50   94
9      ANIL   59   33   51   68   33
10     RUPA   57   91   60   37   44

In [140]:
df_[df_['NEP']>40]  #who passed in nepali subject

   Students  ENG  NEP  MAT  SCI  COM
2     SHYAM   48   49   52   89   64
3      GITA   66   64   75   38   84
4      HARI   55   47   90   82   37
5      SITA   45   93   70   53   76
6   SUSHILA   45   63   33   53   72
8    SUBODH   62   69   67   50   94
10     RUPA   57   91   60   37   44

In [143]:
df_[df_['SCI']>70]   #who got first division in science( let first division be marks above 70)

  Students  ENG  NEP  MAT  SCI  COM
1      RAM   57   34   93   84   54
2    SHYAM   48   49   52   89   64
4     HARI   55   47   90   82   37